app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "subtitle", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "coucou"], ["subtitle", "yesss"], ["content", "pokezpdokzepodkzepodkzepodk"], ["created_at", "2019-07-02 18:40:45.653753"], ["updated_at", "2019-07-02 18:40:45.653753"]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Article 1"], ["content", "voici mon premier article"], ["updated_at", "2019-07-02 17:40:02.762265"], ["id", 8]]